<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"db4a56cdfc87b7fd297aed029b82ded8516991d89cccd164f4404f18c0d8908d","plan_job_ref":"Job plan #24 at https://github.com/GSA/usnotify-ssb/actions/runs/9040157385","plan_out_hash":"96ffaee3ac43acaad5fe7798ac7bafbc84d01bd41b614d974bdced926014a599","plan_hash":"57acb2ce8fa8a4103930a3e389e4943972a031ba6c831969b54a8fe1661ae0f6","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 4 to add, 2 to change, 4 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # module.broker_sms.cloudfoundry_app.ssb will be updated in-place
!~  resource "cloudfoundry_app" "ssb" {
        id                              = "e0d535e5-2a86-4e05-b878-139b2d06d5fc"
        name                            = "ssb-sms"
!~      source_code_hash                = "ftGVu+3yBdfHvtMnw8iiz+r3Da9DjUcFBENDtBW6/oI=" -> "oUiZ1KPctvg3OBTWLTHXp9xFZfxAJgQVyjwzBAlFVt0="
#        (20 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-management"] will be destroyed
  # (because key ["gsa-tts-benefits-studio-prototyping/notify-management"] is not in for_each map)
-   resource "cloudfoundry_service_broker" "space_scoped_broker" {
-       catalog_change                   = false -> null
-       catalog_hash                     = "AtlUxapKsXPtLbJRtxZTa2Ts44c=" -> null
-       fail_when_catalog_not_accessible = false -> null
-       id                               = "dd324353-af5b-4460-98b5-913fb013ff89" -> null
-       name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-management" -> null
-       password                         = (sensitive value) -> null
-       service_plans                    = {
-           "ttsnotify-sms/base" = "c7d673ea-ba82-4f09-9df3-74e8e9b6de6a"
        } -> null
-       services                         = {
-           "ttsnotify-sms" = "fd364221-e979-4d4e-a289-681163df2e65"
        } -> null
-       space                            = "a022fabe-056c-4329-9d4f-3f7a67442d36" -> null
-       url                              = "https://ssb-sms-notify-management.app.cloud.gov" -> null
-       username                         = "88e4aa9e-8a4d-9ec4-8fba-1f7ccbf1ceb4" -> null
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-production"] will be destroyed
  # (because key ["gsa-tts-benefits-studio-prototyping/notify-production"] is not in for_each map)
-   resource "cloudfoundry_service_broker" "space_scoped_broker" {
-       catalog_change                   = false -> null
-       catalog_hash                     = "AtlUxapKsXPtLbJRtxZTa2Ts44c=" -> null
-       fail_when_catalog_not_accessible = false -> null
-       id                               = "c360abb4-f3fa-434b-95c2-85d1f8bddde3" -> null
-       name                             = "ssb-sms-gsa-tts-benefits-studio-prototyping-notify-production" -> null
-       password                         = (sensitive value) -> null
-       service_plans                    = {
-           "ttsnotify-sms/base" = "71f89da8-38ed-4b9d-96c9-ff462762d755"
        } -> null
-       services                         = {
-           "ttsnotify-sms" = "37cbe836-d604-45d1-b1f8-1403f7cb3ff7"
        } -> null
-       space                            = "4447d89a-9735-4d82-94e1-dc07713aa460" -> null
-       url                              = "https://ssb-sms-notify-management.app.cloud.gov" -> null
-       username                         = "88e4aa9e-8a4d-9ec4-8fba-1f7ccbf1ceb4" -> null
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio/notify-management"] will be created
+   resource "cloudfoundry_service_broker" "space_scoped_broker" {
+       catalog_change                   = false
+       catalog_hash                     = (known after apply)
+       fail_when_catalog_not_accessible = false
+       id                               = (known after apply)
+       name                             = "ssb-sms-gsa-tts-benefits-studio-notify-management"
+       password                         = (sensitive value)
+       service_plans                    = (known after apply)
+       services                         = (known after apply)
+       space                            = "a022fabe-056c-4329-9d4f-3f7a67442d36"
+       url                              = "https://ssb-sms-notify-management.app.cloud.gov"
+       username                         = "88e4aa9e-8a4d-9ec4-8fba-1f7ccbf1ceb4"
    }

  # module.broker_sms.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio/notify-production"] will be created
+   resource "cloudfoundry_service_broker" "space_scoped_broker" {
+       catalog_change                   = false
+       catalog_hash                     = (known after apply)
+       fail_when_catalog_not_accessible = false
+       id                               = (known after apply)
+       name                             = "ssb-sms-gsa-tts-benefits-studio-notify-production"
+       password                         = (sensitive value)
+       service_plans                    = (known after apply)
+       services                         = (known after apply)
+       space                            = "4447d89a-9735-4d82-94e1-dc07713aa460"
+       url                              = "https://ssb-sms-notify-management.app.cloud.gov"
+       username                         = "88e4aa9e-8a4d-9ec4-8fba-1f7ccbf1ceb4"
    }

  # module.broker_smtp.cloudfoundry_app.ssb will be updated in-place
!~  resource "cloudfoundry_app" "ssb" {
        id                              = "3cd07f39-b28d-46f3-b6dc-2b60457bec05"
        name                            = "ssb-smtp"
!~      source_code_hash                = "OfGBYaIM6hHzeGqV0dDVPgkeozKZDgjBx0hkCzOK2sc=" -> "PRl4vPYSNHMhDBAiSlTy8Hi4KYc1ed3GHzBZKgVZPWk="
#        (20 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-management"] will be destroyed
  # (because key ["gsa-tts-benefits-studio-prototyping/notify-management"] is not in for_each map)
-   resource "cloudfoundry_service_broker" "space_scoped_broker" {
-       catalog_change                   = false -> null
-       catalog_hash                     = "xsRn_5Fbn_T3MyH1lrKZbd2Bwwk=" -> null
-       fail_when_catalog_not_accessible = false -> null
-       id                               = "7ab65f72-d3de-451b-be85-783ce2b55867" -> null
-       name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-management" -> null
-       password                         = (sensitive value) -> null
-       service_plans                    = {
-           "datagov-smtp/base" = "8e17d607-f960-4c56-9ebe-63f986bf3c4f"
        } -> null
-       services                         = {
-           "datagov-smtp" = "523ab826-743a-4146-bc27-5d6f82e027c5"
        } -> null
-       space                            = "a022fabe-056c-4329-9d4f-3f7a67442d36" -> null
-       url                              = "https://ssb-smtp-notify-management.app.cloud.gov" -> null
-       username                         = "3d6c918b-7997-4b76-d9bf-c0d3878800d1" -> null
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio-prototyping/notify-production"] will be destroyed
  # (because key ["gsa-tts-benefits-studio-prototyping/notify-production"] is not in for_each map)
-   resource "cloudfoundry_service_broker" "space_scoped_broker" {
-       catalog_change                   = false -> null
-       catalog_hash                     = "xsRn_5Fbn_T3MyH1lrKZbd2Bwwk=" -> null
-       fail_when_catalog_not_accessible = false -> null
-       id                               = "76b49f02-670d-4fda-aeb7-307bd0de42e0" -> null
-       name                             = "ssb-smtp-gsa-tts-benefits-studio-prototyping-notify-production" -> null
-       password                         = (sensitive value) -> null
-       service_plans                    = {
-           "datagov-smtp/base" = "54c2c149-dd04-4941-a621-159f5e698e3c"
        } -> null
-       services                         = {
-           "datagov-smtp" = "8bf5287d-587b-4696-8e53-a6ffdba211c0"
        } -> null
-       space                            = "4447d89a-9735-4d82-94e1-dc07713aa460" -> null
-       url                              = "https://ssb-smtp-notify-management.app.cloud.gov" -> null
-       username                         = "3d6c918b-7997-4b76-d9bf-c0d3878800d1" -> null
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio/notify-management"] will be created
+   resource "cloudfoundry_service_broker" "space_scoped_broker" {
+       catalog_change                   = false
+       catalog_hash                     = (known after apply)
+       fail_when_catalog_not_accessible = false
+       id                               = (known after apply)
+       name                             = "ssb-smtp-gsa-tts-benefits-studio-notify-management"
+       password                         = (sensitive value)
+       service_plans                    = (known after apply)
+       services                         = (known after apply)
+       space                            = "a022fabe-056c-4329-9d4f-3f7a67442d36"
+       url                              = "https://ssb-smtp-notify-management.app.cloud.gov"
+       username                         = "3d6c918b-7997-4b76-d9bf-c0d3878800d1"
    }

  # module.broker_smtp.cloudfoundry_service_broker.space_scoped_broker["gsa-tts-benefits-studio/notify-production"] will be created
+   resource "cloudfoundry_service_broker" "space_scoped_broker" {
+       catalog_change                   = false
+       catalog_hash                     = (known after apply)
+       fail_when_catalog_not_accessible = false
+       id                               = (known after apply)
+       name                             = "ssb-smtp-gsa-tts-benefits-studio-notify-production"
+       password                         = (sensitive value)
+       service_plans                    = (known after apply)
+       services                         = (known after apply)
+       space                            = "4447d89a-9735-4d82-94e1-dc07713aa460"
+       url                              = "https://ssb-smtp-notify-management.app.cloud.gov"
+       username                         = "3d6c918b-7997-4b76-d9bf-c0d3878800d1"
    }

Plan: 4 to add, 2 to change, 4 to destroy.

Changes to Outputs:
!~  client_spaces = [
!~      "gsa-tts-benefits-studio-prototyping/notify-management" -> "gsa-tts-benefits-studio/notify-management",
!~      "gsa-tts-benefits-studio-prototyping/notify-production" -> "gsa-tts-benefits-studio/notify-production",
    ]
```
</details>

:memo: Plan generated in [plan #24](https://github.com/GSA/usnotify-ssb/actions/runs/9040157385)